src/Reports/ПроверкаПревышения4СреднихЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ПроверкаПревышения4СреднихЗП</Name>
			<Comment>Проверка превышения средних ЗП</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФондыОсновныеИДополнительные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РазмерыПараметровДляРасчетаРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РазмерыПараметровДляРасчетаРБ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПараметровДляРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CalculationRegisters/ЕСНОсновныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ЕСНОсновныеНачисления</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходЕдиныйПлатеж</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаЕСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыЕСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходФСЗН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходСтрах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CalculationRegisters/ЕСНДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ЕСНДополнительныеНачисления</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисленияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоходЕдиныйПлатеж</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаЕСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыЕСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходФСЗН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходСтрах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/Reports/ПроверкаПревышения4СреднихЗП/Ext/ObjectModule.bsl
// Предназначена для получения выборки из запроса с данными расчета ЕСН
// Параметры:
//  нет
// Возвращаемое значение:
//  Выборка результата запроса
//
Функция ПолучитьДанныеРасчетаФСЗН()
	
	Запрос = Новый Запрос;
	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачДата,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
	если ФондыОсновныеИДополнительные Тогда 
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЕСНОсновныеНачисления.Организация КАК Организация,
		|	ЕСНОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ЕСНОсновныеНачисления.ВидРасчета,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСНОсновныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|					ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|					ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|					ИЛИ ЕСНОсновныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСНОсновныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|								И ЕСНОсновныеНачисления.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|								И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							ТОГДА ВЫРАЗИТЬ(ЕСНОсновныеНачисления.Результат / 10000 КАК ЧИСЛО(10, 2))
		|						ИНАЧЕ ЕСНОсновныеНачисления.Результат
		|					КОНЕЦ
		|		КОНЕЦ) КАК ФондФСЗН,
		|	НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодДействия, МЕСЯЦ) КАК ПериодДействия,
		
		|СУММА( //Аверсон 12.04.2023 КВВ СВФР-010689
		|	ВЫБОР
		|		КОГДА ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|				И ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|				И ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|				И ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСНОсновныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И ЕСНОсновныеНачисления.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|						ТОГДА ВЫРАЗИТЬ(ЕСНОсновныеНачисления.Результат / 10000 КАК ЧИСЛО(10, 2))
		|					ИНАЧЕ ЕСНОсновныеНачисления.Результат
		|				КОНЕЦ
		|	КОНЕЦ 
		|) КАК ФондПревышения,
		
		|	НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодРегистрации, МЕСЯЦ) КАК ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления";
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонПериод, ) КАК РаботникиОрганизацийСрезПоследних
			|	ПО ЕСНОсновныеНачисления.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	(ЕСНОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|			ИЛИ ЕСНОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|			ИЛИ ЕСНОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|			ИЛИ ЕСНОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ))
		|	И ЕСНОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачПериод И &КонПериод
		|	И ЕСНОсновныеНачисления.Организация = &Организация
		|	И ЕСНОсновныеНачисления.Результат <> 0";
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСНОсновныеНачисления.Организация,
		|	ЕСНОсновныеНачисления.Сотрудник,
		|	ЕСНОсновныеНачисления.ВидРасчета,
		|	НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодДействия, МЕСЯЦ),
		|	ВЫБОР
		|		КОГДА ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|				И ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|				И ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|				И ЕСНОсновныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСНОсновныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И ЕСНОсновныеНачисления.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|						ТОГДА ВЫРАЗИТЬ(ЕСНОсновныеНачисления.Результат / 10000 КАК ЧИСЛО(10, 2))
		|					ИНАЧЕ ЕСНОсновныеНачисления.Результат
		|				КОНЕЦ
		|	КОНЕЦ,
		|	НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСНДополнительныеНачисления.Организация,
		|	ЕСНДополнительныеНачисления.Сотрудник,
		|	ЕСНДополнительныеНачисления.ВидРасчета,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСНДополнительныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|					ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|					ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|					ИЛИ ЕСНДополнительныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСНДополнительныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|								И ЕСНДополнительныеНачисления.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|								И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							ТОГДА ВЫРАЗИТЬ(ЕСНДополнительныеНачисления.Результат / 10000 КАК ЧИСЛО(10, 2))
		|						ИНАЧЕ ЕСНДополнительныеНачисления.Результат
		|					КОНЕЦ
		|		КОНЕЦ),
		|	НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ),
		|	ВЫБОР
		|		КОГДА ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|				И ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|				И ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|				И ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСНДополнительныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И ЕСНДополнительныеНачисления.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|						ТОГДА ВЫРАЗИТЬ(ЕСНДополнительныеНачисления.Результат / 10000 КАК ЧИСЛО(10, 2))
		|					ИНАЧЕ ЕСНДополнительныеНачисления.Результат
		|				КОНЕЦ
		|	КОНЕЦ,
		|	НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|ИЗ
		|	РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления";
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонПериод, ) КАК РаботникиОрганизацийСрезПоследних
			|	ПО ЕСНДополнительныеНачисления.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ЕСНДополнительныеНачисления.ПериодРегистрации МЕЖДУ &НачПериод И &КонПериод
		|	И ЕСНДополнительныеНачисления.Организация = &Организация
		|	И (ЕСНДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|			ИЛИ ЕСНДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|			ИЛИ ЕСНДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|			ИЛИ ЕСНДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ))
		|	И ЕСНДополнительныеНачисления.Результат <> 0";
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
		КонецЕсли;

		ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСНДополнительныеНачисления.Организация,
		|	ЕСНДополнительныеНачисления.Сотрудник,
		|	ЕСНДополнительныеНачисления.ВидРасчета,
		|	ВЫБОР
		|		КОГДА ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|				И ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|				И ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|				И ЕСНДополнительныеНачисления.КодДоходаЕСН <> ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСНДополнительныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И ЕСНДополнительныеНачисления.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|						ТОГДА ВЫРАЗИТЬ(ЕСНДополнительныеНачисления.Результат / 10000 КАК ЧИСЛО(10, 2))
		|					ИНАЧЕ ЕСНДополнительныеНачисления.Результат
		|				КОНЕЦ
		|	КОНЕЦ,
		|	НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	ПериодРегистрации,
		|	Сотрудник,
		|	ПериодДействия";
	иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОсновныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	СУММА(ВЫБОР
		|			КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|					И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|					И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|				ТОГДА ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
		|			ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Результат
		|		КОНЕЦ) КАК ФондФСЗН,
		|	NULL КАК ДоходБудущий,
		|	НачалоПериода(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,Месяц) как ПериодДействия
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	(ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ))
		|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачПериод И &КонПериод
		|	И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
		|	И ОсновныеНачисленияРаботниковОрганизаций.Результат <> 0";
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
		КонецЕсли;

		ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеНачисленияРаботниковОрганизаций.Организация,
		|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
		|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	СУММА(ВЫБОР
		|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|					И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|					И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|				ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
		|			ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
		|		КОНЕЦ),
		|	NULL,
		|	НачалоПериода(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, месяц)
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачПериод И &КонПериод
		|	И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
		|	И (ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|			ИЛИ ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|			ИЛИ ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|			ИЛИ ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ))
		|	И ДополнительныеНачисленияРаботниковОрганизаций.Результат <> 0";
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И ДополнительныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
		КонецЕсли;

		ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеНачисленияРаботниковОрганизаций.Организация,
		|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
		|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	NULL,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия > &КонПериод
		|			ТОГДА СУММА(ВЫБОР
		|						КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|								И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|								И &НачПериод >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|							ТОГДА ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
		|						ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Результат
		|					КОНЕЦ)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	НачалоПериода(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, месяц)
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачПериод И &КонПериод
		|	И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
		|	И (ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
		|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
		|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
		|			ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ))
		|	И ОсновныеНачисленияРаботниковОрганизаций.Результат <> 0";
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
		КонецЕсли;

		ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	ПериодДействия,
		|	Сотрудник";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачПериод", НачалоМесяца(НачДата));
	Запрос.УстановитьПараметр("КонПериод", КонецМесяца(КонДата));

	Запрос.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции  // ПолучитьДанныеРасчетаЕСН

Процедура ПолучитьСписокРаботников(ДокументРезультат, Дописать = Ложь) Экспорт
	ДокументРезультат.Очистить();
	
	мМакет = ПолучитьМакет("Макет1");
	если ФондыОсновныеИДополнительные Тогда 
		ОбластьЗаголовок = мМакет.ПолучитьОбласть("Заголовок1");
		ОбластьПериод    = мМакет.ПолучитьОбласть("Период1");
		ОбластьДетали    = мМакет.ПолучитьОбласть("Детали1");
	иначе
		ОбластьЗаголовок = мМакет.ПолучитьОбласть("Заголовок");
		ОбластьПериод    = мМакет.ПолучитьОбласть("Период");
		ОбластьДетали    = мМакет.ПолучитьОбласть("Детали");
	КонецЕсли;
	ОбластьИтоги     = мМакет.ПолучитьОбласть("ОбщиеИтоги");
	
	ДанныеДляРасчетаЕСН = ПолучитьДанныеРасчетаФСЗН().Выгрузить();
	Если ФондыОсновныеИДополнительные Тогда 
		ДанныеДляРасчетаЕСН.Свернуть("Организация, ПериодРегистрации, ПериодДействия, Сотрудник", "ФондФСЗН,ФондПревышения");
	иначе                  		
		ДанныеДляРасчетаЕСН.Свернуть("Организация, ПериодДействия, Сотрудник", "ФондФСЗН, ДоходБудущий");
	КонецЕсли;
	
	РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(НачДата) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
	
	Если РазмерСреднейЗарплаты = 0 Тогда
		Предупреждение("Для данного расчетного периода не внесен параметр ""Средняя зарплата работников (для ограничения отчислений с ФОТ)""");
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.Организация = Организация;	
	//ОбластьЗаголовок.Параметры.СредняяЗП = РазмерСреднейЗарплаты;	
	ОбластьЗаголовок.Параметры.Период = РаботаСДиалогами.ДатаКакМесяцПредставление(КонДата);
	ДокументРезультат.Вывести(ОбластьЗаголовок);

	Номер = 0; ФондФСЗН = 0; СредняяЗП = 0;	Сумма = 0;	СуммаОтпуска = 0;
	ПериодТек = "";
	СотрПрошл = "";
	ПериодТекДействия = "";
	ТЗПревышенияТекМесяца = Новый ТаблицаЗначений;
	ТЗПревышенияТекМесяца.Колонки.Добавить("Сотрудник");
	
	Для Каждого ТекСтрока Из ДанныеДляРасчетаЕСН Цикл
		//О.Т. Аверсон 27.03.2016 № 950
		Если ТекСтрока.Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
		иначе
			ВидНалогообложения = ТекСтрока.Сотрудник.ВидНалогообложенияОсновной;
		КонецЕсли;
		//О.Т. Аверсон 27.03.2016 № 950
		Если ПериодТекДействия <> ТекСтрока.ПериодДействия Тогда
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ТекСтрока.ПериодДействия) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
		КонецЕсли;
		
		
		СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ТекСтрока.ПериодДействия),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 27.03.2016 № 950
		СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ТекСтрока.ПериодДействия),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения));//О.Т. Аверсон 27.03.2016 № 950
		РазмерОграничения = СтруктураПенс.ОграничениеПоДоходам * РазмерСреднейЗарплаты;//О.Т. 11.12.2014 № 17714
		
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалогообложения = &ВидНалогообложения
		|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", КонецМесяца(ТекСтрока.ПериодДействия));
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", ТекСтрока.Сотрудник); 
		РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		ЕстьИндивидСтавка = Ложь;
		СтавкаПенсионныйФонд = 0;
		СтавкаФСЗН = 0;
		Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
			ЕстьИндивидСтавка = Истина;
			СтавкаПенсионныйФонд = РезИндСтавкаНалогообл[0].ПенсионныйФонд;
			СтавкаФСЗН = РезИндСтавкаНалогообл[0].ФСЗН;
		иначе
			Если СтруктураПенс.Количество()<>0 тогда
				СтавкаПенсионныйФонд = СтруктураПенс.Размер;
			Иначе
				Сообщить("Не заполнена ставка пенсионного фонда");
				СтавкаПенсионныйФонд = 0;
			КонецЕсли;
			
			Если СтруктураФСЗН.Количество()<>0 тогда
				СтавкаФСЗН = СтруктураФСЗН.Размер;
			Иначе
				Сообщить("Не заполнена ставка отчислений в ФСЗН");
				СтавкаФСЗН = 0;
			КонецЕсли;
		КонецЕсли;
		//О.Т. 11.06.2015 № 
		ЗапросГр = Новый Запрос;
		ЗапросГр.Текст = 
		"ВЫБРАТЬ
		|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
		|	ГражданствоФизЛицСрезПоследних.Страна,
		|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию,
		|	ГражданствоФизЛицСрезПоследних.ИнаяСтавка
		|ИЗ
		|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(, ) КАК ГражданствоФизЛицСрезПоследних
		|ГДЕ
		|	ГражданствоФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
		
		ЗапросГр.УстановитьПараметр("ФизЛицо", ТекСтрока.Сотрудник.ФизЛицо);
		
		РезультатЗапроса = ЗапросГр.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		НеИмеетПравоНаПенсию = Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НеИмеетПравоНаПенсию = ВыборкаДетальныеЗаписи.НеИмеетПравоНаПенсию;
		КонецЦикла;
		//О.Т. 11.06.2015 № 
		
		Если ФондыОсновныеИДополнительные Тогда 
			Если ?(ТекСтрока.ФондПревышения = Null,0,ТекСтрока.ФондПревышения) > 0 или (ТекСтрока.ПериодРегистрации < ТекСтрока.ПериодДействия и ТекСтрока.ФондФСЗН > 0 и СотрПрошл = ТекСтрока.Сотрудник и
				ТЗПревышенияТекМесяца.НайтиСтроки(Новый Структура("Сотрудник",ТекСтрока.Сотрудник)).Количество()>0) Тогда 
				Номер = Номер + 1;
				
				//О.Т. 11.06.2015 № 
				РезультатЗапроса = ЗапросГр.Выполнить();			
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ОграничениеОбнулять = Ложь;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					если ВыборкаДетальныеЗаписи.НеИмеетПравоНаПенсию или ВыборкаДетальныеЗаписи.ИнаяСтавка > 0 Тогда 
						ОграничениеОбнулять = Истина;
					КонецЕсли;
				КонецЦикла;
				//О.Т. 11.06.2015 № 
				Если ПериодТек <> ТекСтрока.ПериодРегистрации Тогда
					//РазмерСреднейЗарплаты1 = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ТекСтрока.ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
		
					ОбластьПериод.Параметры.Период = Формат(ТекСтрока.ПериодРегистрации,"ДЛФ=Д"); //+ " Средняя зарплата: " + Строка(РазмерСреднейЗарплаты1);
					ДокументРезультат.Вывести(ОбластьПериод);
					Номер = 1;
				КонецЕсли;
				
				ОбластьДетали.Параметры.Номер = Номер;	
				ОбластьДетали.Параметры.ТН = ТекСтрока.Сотрудник.Код;	
				ОбластьДетали.Параметры.Сотрудник = ТекСтрока.Сотрудник;
				
				Если ТекСтрока.ПериодРегистрации = ТекСтрока.ПериодДействия тогда
					СтрТЗПревышенияТекМесяца = ТЗПревышенияТекМесяца.Добавить();
					СтрТЗПревышенияТекМесяца.Сотрудник = ТекСтрока.Сотрудник;
				КонецЕсли;
				
				Если ТекСтрока.ПериодРегистрации < ТекСтрока.ПериодДействия тогда 
					ОбластьДетали.Параметры.СуммаОтпуска = ТекСтрока.ФондФСЗН + ТекСтрока.ФондПревышения;
					ОбластьДетали.Параметры.ФондФСЗН = "";
					СуммаОтпуска = СуммаОтпуска + ТекСтрока.ФондФСЗН+ТекСтрока.ФондПревышения;
					
				иначе        					
					ОбластьДетали.Параметры.ФондФСЗН = ТекСтрока.ФондФСЗН + ТекСтрока.ФондПревышения;
					ОбластьДетали.Параметры.СуммаОтпуска = "";
				КонецЕсли;
				ОбластьДетали.Параметры.ПериодДействия = Формат(ТекСтрока.ПериодДействия,"ДФ='ММММ гггг'");
				//О.Т. 11.06.2015 № 
				если ОграничениеОбнулять Тогда 
					ОбластьДетали.Параметры.СредняяЗП = "";	
					ОбластьДетали.Параметры.Сумма = ТекСтрока.ФондФСЗН;
				иначе
					
					ОбластьДетали.Параметры.СредняяЗП = РазмерОграничения;	
					ОбластьДетали.Параметры.Сумма = ТекСтрока.ФондПревышения;
				КонецЕсли;
				//О.Т. 11.06.2015 № 
				
				
				ДокументРезультат.Вывести(ОбластьДетали);
				
				ФондФСЗН = ФондФСЗН + ТекСтрока.ФондФСЗН+ТекСтрока.ФондПревышения;
				//О.Т. 11.06.2015 № 
				если ОграничениеОбнулять Тогда
					СредняяЗП = СредняяЗП;
					Сумма = Сумма + ТекСтрока.ФондФСЗН+ТекСтрока.ФондПревышения;
				Иначе 
					СредняяЗП = СредняяЗП + РазмерОграничения;
					Сумма = Сумма + ТекСтрока.ФондПревышения;
				КонецЕсли;
				//О.Т. 11.06.2015 № 
				
				ПериодТек = ТекСтрока.ПериодРегистрации;
				ПериодТекДействия = ТекСтрока.ПериодДействия; 

				СотрПрошл = ТекСтрока.Сотрудник;
			КонецЕсли;
			
		иначе
			
			Если ТекСтрока.ФондФСЗН > РазмерОграничения или НеИмеетПравоНаПенсию Тогда
				Номер = Номер + 1;
				
				//О.Т. 11.06.2015 № 
				РезультатЗапроса = ЗапросГр.Выполнить();			
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ОграничениеОбнулять = Ложь;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					если ВыборкаДетальныеЗаписи.НеИмеетПравоНаПенсию или ВыборкаДетальныеЗаписи.ИнаяСтавка > 0 Тогда 
						ОграничениеОбнулять = Истина;
					КонецЕсли;
				КонецЦикла;
				//О.Т. 11.06.2015 № 
				Если ПериодТек <> ТекСтрока.ПериодДействия Тогда 
					ОбластьПериод.Параметры.Период = Формат(ТекСтрока.ПериодДействия,"ДЛФ=Д")+ " Средняя зарплата: " + Строка(РазмерСреднейЗарплаты);
					ДокументРезультат.Вывести(ОбластьПериод);
					Номер = 1;
				КонецЕсли;
				
				ОбластьДетали.Параметры.Номер = Номер;	
				ОбластьДетали.Параметры.ТН = ТекСтрока.Сотрудник.Код;	
				ОбластьДетали.Параметры.Сотрудник = ТекСтрока.Сотрудник;
				ОбластьДетали.Параметры.ФондФСЗН = ТекСтрока.ФондФСЗН;
				//О.Т. 11.06.2015 № 
				если ОграничениеОбнулять Тогда 
					ОбластьДетали.Параметры.СредняяЗП = "";	
					ОбластьДетали.Параметры.Сумма = ТекСтрока.ФондФСЗН;
				иначе
					
					ОбластьДетали.Параметры.СредняяЗП = РазмерОграничения;	
					ОбластьДетали.Параметры.Сумма = ТекСтрока.ФондФСЗН - РазмерОграничения;
				КонецЕсли;
				//О.Т. 11.06.2015 № 
				ОбластьДетали.Параметры.СуммаОтпуска = ТекСтрока.ДоходБудущий;
				
				ДокументРезультат.Вывести(ОбластьДетали);
				
				ФондФСЗН = ФондФСЗН + ТекСтрока.ФондФСЗН;
				//О.Т. 11.06.2015 № 
				если ОграничениеОбнулять Тогда
					СредняяЗП = СредняяЗП;
					Сумма = Сумма + ТекСтрока.ФондФСЗН;
				Иначе 
					СредняяЗП = СредняяЗП + РазмерОграничения;
					Сумма = Сумма + (ТекСтрока.ФондФСЗН - РазмерОграничения);
				КонецЕсли;
				//О.Т. 11.06.2015 № 
				СуммаОтпуска = СуммаОтпуска + ТекСтрока.ДоходБудущий;
				ПериодТек = ТекСтрока.ПериодДействия;
				ПериодТекДействия = ТекСтрока.ПериодДействия;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьИтоги.Параметры.ФондФСЗН = ФондФСЗН;	
	ОбластьИтоги.Параметры.СредняяЗП = СредняяЗП;	
	ОбластьИтоги.Параметры.Сумма = Сумма;
	ОбластьИтоги.Параметры.СуммаОтпуска = СуммаОтпуска;
	
	ДокументРезультат.Вывести(ОбластьИтоги);
	
КонецПроцедуры
